TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_dma.h
/* DMA_DESC Bits */
/* DMA_DESC[MINREV] Bits */
#define DMA_DESC_MINREV_OFS                      (0)                             /* !< MINREV Offset */
#define DMA_DESC_MINREV_MASK                     ((uint32_t)0x0000000FU)         /* !< Minor rev of the IP */
#define DMA_DESC_MINREV_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define DMA_DESC_MINREV_MAXIMUM                  ((uint32_t)0x0000000FU)         /* !< Highest possible value */
/* DMA_DESC[MAJREV] Bits */
#define DMA_DESC_MAJREV_OFS                      (4)                             /* !< MAJREV Offset */
#define DMA_DESC_MAJREV_MASK                     ((uint32_t)0x000000F0U)         /* !< Major rev of the IP */
#define DMA_DESC_MAJREV_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define DMA_DESC_MAJREV_MAXIMUM                  ((uint32_t)0x000000F0U)         /* !< Highest possible value */
/* DMA_DESC[FEATUREVER] Bits */
#define DMA_DESC_FEATUREVER_OFS                  (12)                            /* !< FEATUREVER Offset */
#define DMA_DESC_FEATUREVER_MASK                 ((uint32_t)0x0000F000U)         /* !< Feature Set for the DMA: number of
                                                                                    DMA channel minus one  (e.g. 0->1ch,
                                                                                    2->3ch, 15->16ch). */
#define DMA_DESC_FEATUREVER_MINIMUM              ((uint32_t)0x00000000U)         /* !< Smallest value (1 channel) */
#define DMA_DESC_FEATUREVER_MAXIMUM              ((uint32_t)0x0000F000U)         /* !< Highest value (16 channel) */
/* DMA_DESC[MODULEID] Bits */
#define DMA_DESC_MODULEID_OFS                    (16)                            /* !< MODULEID Offset */
#define DMA_DESC_MODULEID_MASK                   ((uint32_t)0xFFFF0000U)         /* !< Module identification contains a
                                                                                    unique peripheral identification
                                                                                    number. The assignments are
                                                                                    maintained in a central database for
                                                                                    all of the platform modules to ensure
                                                                                    uniqueness. */
#define DMA_DESC_MODULEID_MINIMUM                ((uint32_t)0x00000000U)         /* !< Smallest value */
#define DMA_DESC_MODULEID_MAXIMUM                ((uint32_t)0xFFFF0000U)         /* !< Highest possible value */

/* DMA_DMAPRIO Bits */
/* DMA_DMAPRIO[ROUNDROBIN] Bits */
#define DMA_DMAPRIO_ROUNDROBIN_OFS               (0)                             /* !< ROUNDROBIN Offset */
#define DMA_DMAPRIO_ROUNDROBIN_MASK              ((uint32_t)0x00000001U)         /* !< Round robin. This bit enables the
                                                                                    round-robin DMA channel priorities. */
#define DMA_DMAPRIO_ROUNDROBIN_DISABLE           ((uint32_t)0x00000000U)         /* !< Roundrobin priority disabled, DMA
                                                                                    channel priority is fixed:
                                                                                    DMA0-DMA1-DMA2-...-DMA16 */
#define DMA_DMAPRIO_ROUNDROBIN_ENABLE            ((uint32_t)0x00000001U)         /* !< Roundrobin priority enabled, DMA
                                                                                    channel priority changes with each
                                                                                    transfer */
/* DMA_DMAPRIO[BURSTSZ] Bits */
#define DMA_DMAPRIO_BURSTSZ_OFS                  (16)                            /* !< BURSTSZ Offset */
#define DMA_DMAPRIO_BURSTSZ_MASK                 ((uint32_t)0x00030000U)         /* !< Define the burst size of a block
                                                                                    transfer, before the priority is
                                                                                    re-evaluated */
#define DMA_DMAPRIO_BURSTSZ_INFINITI             ((uint32_t)0x00000000U)         /* !< There is no burst size, the whole
                                                                                    block transfer is completed on one
                                                                                    transfer without interruption */
#define DMA_DMAPRIO_BURSTSZ_BURST_8              ((uint32_t)0x00010000U)         /* !< The burst size is 8, after 8
                                                                                    transfers the block transfer is
                                                                                    interrupted and the priority is
                                                                                    reevaluated */
#define DMA_DMAPRIO_BURSTSZ_BUSRT_16             ((uint32_t)0x00020000U)         /* !< The burst size is 16, after 16
                                                                                    transfers the block transfer is
                                                                                    interrupted and the priority is
                                                                                    reevaluated */
#define DMA_DMAPRIO_BURSTSZ_BURST_32             ((uint32_t)0x00030000U)         /* !< The burst size is 32, after 32
                                                                                    transfers the block transfer is
                                                                                    interrupted and the priority is
                                                                                    reevaluated */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_dma__include */
